import { Component, OnInit } from '@angular/core';
import * as $ from "jquery";
@Component({
  selector: 'app-station',
  templateUrl: './station.component.html',
  styleUrls: ['./station.component.css']
})


export class StationComponent implements OnInit {
msglist:any;
  constructor() { }

  ngOnInit() {
  	this.msglist=[
  	['广盈实业有限公司','光伏电站','办公园区','440KW','梁溪区','7年','10%',120.34566,30.12343],
  	['广盈实业有限公司','光伏电站','办公园区','440KW','梁溪区','7年','9%',120.34566,30.12343],
  	['广盈实业有限公司','光伏电站','办公园区','440KW','梁溪区','7年','8%',120.34566,30.12343],
  	['广盈实业有限公司','光伏电站','办公园区','440KW','梁溪区','7年','7%',120.34566,30.12343],
  	['广盈实业有限公司','光伏电站','办公园区','440KW','梁溪区','7年','6%',120.34566,30.12343],
  	['广盈实业有限公司','光伏电站','办公园区','440KW','梁溪区','7年','5%',120.34566,30.12343],
  	['广盈实业有限公司','光伏电站','办公园区','440KW','梁溪区','7年','4%',120.34566,30.12343],
  	['广盈实业有限公司','光伏电站','办公园区','440KW','梁溪区','7年','3%',120.34566,30.12343],
  	['广盈实业有限公司','光伏电站','办公园区','440KW','梁溪区','7年','2%',120.34566,30.12343],
  	['广盈实业有限公司','光伏电站','办公园区','440KW','梁溪区','7年','1%',120.34566,30.12343],
  	]
  	
//			$("#page-container-static-normal").page({
//				count:40,
//				theme: "normal"
//			});
  }

}
