import { Component, OnInit } from '@angular/core';
import * as $ from "jquery";
@Component({
	selector: 'app-equipment',
	templateUrl: './equipment.component.html',
	styleUrls: ['./equipment.component.css']
})
export class EquipmentComponent implements OnInit {
	msglist: any;
	page: number = 1;
	maxPage: number = 1;
	pageArr: any;
	constructor() {}

	ngOnInit() {
		this.msglist = [
			['广盈实业有限公司', '梁溪区', '000000000001', '一号楼屋顶光伏', '已接入', '2018-03-28 12:23:22'],
			['广盈实业有限公司', '梁溪区', '000000000001', '一号楼屋顶光伏', '已接入', '2018-03-28 12:23:22'],
			['广盈实业有限公司', '梁溪区', '000000000001', '一号楼屋顶光伏', '已接入', '2018-03-28 12:23:22'],
			['广盈实业有限公司', '梁溪区', '000000000001', '一号楼屋顶光伏', '已接入', '2018-03-28 12:23:22'],
			['广盈实业有限公司', '梁溪区', '000000000001', '一号楼屋顶光伏', '已接入', '2018-03-28 12:23:22'],
			['广盈实业有限公司', '梁溪区', '000000000001', '一号楼屋顶光伏', '已接入', '2018-03-28 12:23:22'],
			['广盈实业有限公司', '梁溪区', '000000000001', '一号楼屋顶光伏', '已接入', '2018-03-28 12:23:22'],
			['广盈实业有限公司', '梁溪区', '000000000001', '一号楼屋顶光伏', '已接入', '2018-03-28 12:23:22'],
			['广盈实业有限公司', '梁溪区', '000000000001', '一号楼屋顶光伏', '已接入', '2018-03-28 12:23:22'],
			['广盈实业有限公司', '梁溪区', '000000000001', '一号楼屋顶光伏', '已接入', '2018-03-28 12:23:22'],
			['广盈实业有限公司', '梁溪区', '000000000001', '一号楼屋顶光伏', '已接入', '2018-03-28 12:23:22'],
			['广盈实业有限公司', '梁溪区', '000000000001', '一号楼屋顶光伏', '已接入', '2018-03-28 12:23:22'],
			['广盈实业有限公司', '梁溪区', '000000000001', '一号楼屋顶光伏', '已接入', '2018-03-28 12:23:22'],
			['广盈实业有限公司', '梁溪区', '000000000001', '一号楼屋顶光伏', '已接入', '2018-03-28 12:23:22'],
			['广盈实业有限公司', '梁溪区', '000000000001', '一号楼屋顶光伏', '已接入', '2018-03-28 12:23:22'],
			['广盈实业有限公司', '梁溪区', '000000000001', '一号楼屋顶光伏', '已接入', '2018-03-28 12:23:22'],
		];
			this.maxPage = Math.ceil((this.msglist.length) / 10);
		this.pageArr = [];
		for(let i = 1; i <= this.maxPage; i++) {
			this.pageArr.push(i)
		}
	}
	prev() {
		if(this.page > 1) {
			this.page--
		} else {
			return;
		}
	}
	first() {
		
		this.page = 1;
	}
	last() {
		this.page = this.maxPage;
	}
	next() {
		if(this.page < this.maxPage) {
			this.page++
		} else {
			return;
		}
	}
}