import { Component, OnInit } from '@angular/core';
import * as $ from "jquery";
@Component({
  selector: 'app-equipment',
  templateUrl: './equipment.component.html',
  styleUrls: ['./equipment.component.css']
})
export class EquipmentComponent implements OnInit {
msglist:any;
  constructor() { }

  ngOnInit() {
  	  	this.msglist=[
  	['广盈实业有限公司','梁溪区','000000000001','一号楼屋顶光伏','已接入','2018-03-28 12:23:22'],
  	['广盈实业有限公司','梁溪区','000000000001','一号楼屋顶光伏','已接入','2018-03-28 12:23:22'],
  	['广盈实业有限公司','梁溪区','000000000001','一号楼屋顶光伏','已接入','2018-03-28 12:23:22'],
  	['广盈实业有限公司','梁溪区','000000000001','一号楼屋顶光伏','已接入','2018-03-28 12:23:22'],
  	['广盈实业有限公司','梁溪区','000000000001','一号楼屋顶光伏','已接入','2018-03-28 12:23:22'],
  	['广盈实业有限公司','梁溪区','000000000001','一号楼屋顶光伏','已接入','2018-03-28 12:23:22'],
  	['广盈实业有限公司','梁溪区','000000000001','一号楼屋顶光伏','已接入','2018-03-28 12:23:22'],
  	['广盈实业有限公司','梁溪区','000000000001','一号楼屋顶光伏','已接入','2018-03-28 12:23:22'],
  	['广盈实业有限公司','梁溪区','000000000001','一号楼屋顶光伏','已接入','2018-03-28 12:23:22'],
  	['广盈实业有限公司','梁溪区','000000000001','一号楼屋顶光伏','已接入','2018-03-28 12:23:22'],
  	]
  }

}
